var activities = [
  // 极限编程
  { name: "提交代码", good: "遇到冲突的几率是最低的", bad: "遇到的一大堆冲突会让你觉得自己是不是时间穿越了" },
  { name: "代码审核", good: "发现重要问题的几率大大增加", bad: "什么问题都发现不了，白白浪费时间" },
  { name: "重构", good: "代码质量得到提高", bad: "你很有可能会陷入泥潭" },
  { name: "结对编程", good: "优秀的沟通使得编程质量大大提升", bad: "沟通遇到障碍导致键盘手与陪审员大打出手" },

  // 敏捷开发
  { name: "举行冲刺回顾会", good: "收集到大量的反馈", bad: "变成了冲刺检讨会" },
  { name: "举行冲刺规划会", good: "团队自发完成了待办故事的承诺", bad: "变成了气氛尴尬的戏剧" },
  { name: "举行故事评审会", good: "团队达成了共识", bad: "所有估算都是脑拍的" },
  { name: "举行每日审会", good: "团队发现并跨越了挑战", bad: "PO寻思着暂停冲刺" },

  // 持续集成
  { name: "白天上线", good: "今天白天上线是安全的", bad: "可能导致灾难性后果" },
  { name: "晚上上线", good: "晚上是程序员精神最好的时候", bad: "白天已经筋疲力尽了" },

  // 持续测试
  { name: "改进单元测试", good: "写单元测试将减少出错", bad: "写单元测试会降低开发效率" },
  { name: "修复BUG", good: "今天对BUG的嗅觉大大提高", bad: "新产生的BUG将比修复的更多" },

  // 沟通交流
  { name: "组织培训会", good: "写代码之余放松一下打个盹，有益健康", bad: "小心被扣屎盆子背黑锅" },
  { name: "组织AAR", good: "参与成员同步了信息又改进了过程", bad: "出门右拐只有就全忘了" },

  // PoseMethod
  { name: "关键跑姿训练", good: "为了更好的落下", bad: "感觉不到脚踝是否在重心下方" },
  { name: "落下训练", good: "落下知觉得到了提升，跑步技术又进步了", bad: "弯腰低头圆肩让你缩成一团" },
  { name: "拉起训练", good: "拉起训练提升了你的跑步技术", bad: "过于在意前脚掌着地的结果是不对的" },
  { name: "弹跳训练", good: "弹性增强使得运用重力的技术提升", bad: "沉重的落地声预示着受伤的风险" },
  { name: "转换支撑训练", good: "你的知觉变得好了", bad: "坐着跑的姿势很难看的" },
  { name: "肌力训练", good: "增强力量后你的速度变得更快", bad: "DOMS让你一动都不想动" },
  { name: "力量训练", good: "增强力量后你的速度变得更快", bad: "DOMS让你一动都不想动" },

  // 周末
  { name: "读书", good: "读书是提升自己的捷径", bad: "用眼过度需要缓和", weekend: true },
  { name: "锻炼", good: "强身健体", bad: "能量没消耗多少，吃得却更多", weekend: true },
  { name: "玩PS4", good: "只狼拜年剑法习得", bad: "菜", weekend: true },
  { name: "访问B站", good: "sggggy同学的视频又更新了", bad: "你关注的UP主成为失踪人口", weekend: true },
  { name: "玩Nintendo Switch", good: "拯救塞尔达公主", bad: "被人马按着打", weekend: true }
];

var drinks = [
  "《物演通论》", 
  "《物种起源》", 
  "《科学革命的结构》", 
  "《经济发展理论》", 
  "《创新者的窘境》", 
  "《技术的本质》",
  "《第二曲线》", 
  "《众病之王 : 癌症传》", 
  "《姿势跑法（实践篇） : 跑得更快，更有效率，不受伤的跑步方法》", 
  "《CEO说：人人都应该像企业家一样思考》", 
  "《人力资源转型：为组织创造价值和达成成果》", 
  "《敏捷教练 : 如何打造优秀的敏捷团队》", 
  "《21世纪高等学校应用型特色精品规划教材·经济管理系列·项目管理:PRINCE2+PMBOK》", 
  "《什么是科学》", 
  "《犯罪心理研究》", 
  "《清单革命》"
  ];

var quotes = [
  "不管是坏孩子还是好孩子，疼痛都是一样的——《爱在高中》，导演，成俊海",
  "用沙子垒砌的城堡，无论是出于保护还是禁锢的目的，在大浪面前，下场都没什么差异。总有人会对身后的危险浑然不觉，免于受难的幸运儿欢欣雀跃之余，忘记了自己的幸运要靠牺牲来换",
  "每当你想批评别人的时候，要记住，这世上并不是所有人，都有你拥有的那些优越条件"
];
var directions = ["北方", "东北方", "东方", "东南方", "南方", "西南方", "西方", "西北方"];
module.exports = {
  activities: activities,
  drinks: drinks,
  quotes: quotes,
  directions: directions
}